-- 1. 팀 생성 (ID 명시)
INSERT INTO teams (name, short_name, team_code)
VALUES ('롯데자이언츠', '롯데', 'LT'),
       ('한화이글스', '한화', 'HH'),
       ('삼성 라이온즈', '삼성', 'SS'),
       ('두산 베어스', '두산', 'OB');

-- 2. 멤버 생성 (ID 명시, team_id는 위에서 명시한 ID 참조)
INSERT INTO members (team_id, nickname, email, provider, oauth_id, role, image_url)
VALUES (1, '포라', 'fora@example.com', 'GOOGLE', 'sub-fora', 'USER', 'https://image.com/fora.png'),
       (2, '파이브라', 'fivera@example.com', 'GOOGLE', 'sub-fivera', 'USER', 'https://image.com/fivera.png'),
       (3, '식스라', 'sixra@example.com', 'GOOGLE', 'sub-sixra', 'USER', 'https://image.com/sixra.png'),
       (4, '세븐라', 'sevenra@example.com', 'GOOGLE', 'sub-sevenra', 'USER', 'https://image.com/sevenra.png'),
       (4, '에잇라', 'eightra@example.com', 'GOOGLE', 'sub-eightra', 'USER', 'https://image.com/eightra.png'),
       (4, '나인라', 'ninera@example.com', 'GOOGLE', 'sub-ninera', 'USER', 'https://image.com/ninera.png'),
       (4, '텐라', 'tenra@example.com', 'GOOGLE', 'sub-tenra', 'USER', 'https://image.com/tenra.png'),
       (4, '일레븐라', 'elevenra@example.com', 'GOOGLE', 'sub-elevenra', 'USER', 'https://image.com/elevenra.png'),
       (4, '트웰브라', 'twelvera@example.com', 'GOOGLE', 'sub-twelvera', 'USER', 'https://image.com/twelvera.png'),
       (4, '써틴라', 'thirteenra@example.com', 'GOOGLE', 'sub-thirteenra', 'USER', 'https://image.com/thirteenra.png'),
       (4, '포틴라', 'fourteenra@example.com', 'GOOGLE', 'sub-fourteenra', 'USER', 'https://image.com/fourteenra.png'),
       (4, '피프틴라', 'fifteenra@example.com', 'GOOGLE', 'sub-fifteenra', 'USER', 'https://image.com/fifteenra.png');
-- 3. 구장 생성 (ID 명시)
INSERT INTO stadiums (full_name, short_name, location, latitude, longitude)
VALUES ('사직야구장', '사직구장', '부산', 35.1943, 129.0615),
       ('창원 NC파크', '엔씨파크', '창원', 35.222754, 128.582251);

-- 4. 경기 생성 (ID 명시, stadium_id, home_team_id, away_team_id는 위에서 명시한 ID 참조)
INSERT INTO games (stadium_id, home_team_id, away_team_id, date, start_at, home_score, away_score, game_code)
VALUES (1, 1, 2, '2025-07-25', '18:00', 10, 0, '20250721LGHT0'),
       (2, 3, 4, '2025-07-25', '18:00', 9, 0, '20250720WOHT0');

-- 5. 톡 52개 생성
-- 기준 시간: 2025-07-25 15:00:00
INSERT INTO talks (game_id, member_id, content, created_at)
VALUES (1, 1, '메세지 1', '2025-07-25 15:00:00'),
       (1, 2, '메세지 2', '2025-07-25 15:01:00'),
       (1, 1, '메세지 3', '2025-07-25 15:02:00'),
       (1, 2, '메세지 4', '2025-07-25 15:03:00'),
       (1, 1, '메세지 5', '2025-07-25 15:04:00'),
       (1, 2, '메세지 6', '2025-07-25 15:05:00'),
       (1, 1, '메세지 7', '2025-07-25 15:06:00'),
       (1, 2, '메세지 8', '2025-07-25 15:07:00'),
       (1, 1, '메세지 9', '2025-07-25 15:08:00'),
       (1, 2, '메세지 10', '2025-07-25 15:09:00'),
       (1, 1, '메세지 11', '2025-07-25 15:10:00'),
       (1, 2, '메세지 12', '2025-07-25 15:11:00'),
       (1, 1, '메세지 13', '2025-07-25 15:12:00'),
       (1, 2, '메세지 14', '2025-07-25 15:13:00'),
       (1, 1, '메세지 15', '2025-07-25 15:14:00'),
       (1, 2, '메세지 16', '2025-07-25 15:15:00'),
       (1, 1, '메세지 17', '2025-07-25 15:16:00'),
       (1, 2, '메세지 18', '2025-07-25 15:17:00'),
       (1, 1, '메세지 19', '2025-07-25 15:18:00'),
       (1, 2, '메세지 20', '2025-07-25 15:19:00'),
       (1, 1, '메세지 21', '2025-07-25 15:20:00'),
       (1, 2, '메세지 22', '2025-07-25 15:21:00'),
       (1, 1, '메세지 23', '2025-07-25 15:22:00'),
       (1, 2, '메세지 24', '2025-07-25 15:23:00'),
       (1, 1, '메세지 25', '2025-07-25 15:24:00'),
       (1, 2, '메세지 26', '2025-07-25 15:25:00'),
       (1, 1, '메세지 27', '2025-07-25 15:26:00'),
       (1, 2, '메세지 28', '2025-07-25 15:27:00'),
       (1, 1, '메세지 29', '2025-07-25 15:28:00'),
       (1, 2, '메세지 30', '2025-07-25 15:29:00'),
       (1, 1, '메세지 31', '2025-07-25 15:30:00'),
       (1, 2, '메세지 32', '2025-07-25 15:31:00'),
       (1, 1, '메세지 33', '2025-07-25 15:32:00'),
       (1, 2, '메세지 34', '2025-07-25 15:33:00'),
       (1, 1, '메세지 35', '2025-07-25 15:34:00'),
       (1, 2, '메세지 36', '2025-07-25 15:35:00'),
       (1, 1, '메세지 37', '2025-07-25 15:36:00'),
       (1, 2, '메세지 38', '2025-07-25 15:37:00'),
       (1, 1, '메세지 39', '2025-07-25 15:38:00'),
       (1, 2, '메세지 40', '2025-07-25 15:39:00'),
       (1, 1, '메세지 41', '2025-07-25 15:40:00'),
       (1, 2, '메세지 42', '2025-07-25 15:41:00'),
       (1, 1, '메세지 43', '2025-07-25 15:42:00'),
       (1, 2, '메세지 44', '2025-07-25 15:43:00'),
       (1, 1, '메세지 45', '2025-07-25 15:44:00'),
       (1, 2, '메세지 46', '2025-07-25 15:45:00'),
       (1, 1, '메세지 47', '2025-07-25 15:46:00'),
       (1, 2, '메세지 48', '2025-07-25 15:47:00'),
       (1, 1, '메세지 49', '2025-07-25 15:48:00'),
       (1, 2, '메세지 50', '2025-07-25 15:49:00'),
       (1, 1, '메세지 51', '2025-07-25 15:50:00'),
       (1, 2, '메세지 52', '2025-07-25 15:51:00');

INSERT INTO talk_reports (talk_id, reporter_id, reported_at)
VALUES (12, 1, '2025-07-25 15:51:00'),
       (12, 3, '2025-07-25 15:52:00'),
       (12, 4, '2025-07-25 15:53:00'),
       (12, 5, '2025-07-25 15:54:00'),
       (12, 6, '2025-07-25 15:55:00'),
       (12, 7, '2025-07-25 15:56:00'),
       (12, 8, '2025-07-25 15:57:00'),
       (12, 9, '2025-07-25 15:58:00'),
       (12, 10, '2025-07-25 15:59:00'),
       (12, 11, '2025-07-25 16:00:00');
