-- 1. 팀 데이터
INSERT INTO teams (name, short_name, team_code)
VALUES ('KIA 타이거즈', 'KIA', 'HT'),
       ('LG 트윈스', 'LG', 'LG'),
       ('키움 히어로즈', '키움', 'WO'),
       ('KT 위즈', 'KT', 'KT'),
       ('삼성 라이온즈', '삼성', 'SS'),
       ('롯데 자이언츠', '롯데', 'LT'),
       ('SSG 랜더스', 'SSG', 'SK'),
       ('NC 다이노스', 'NC', 'NC'),
       ('한화 이글스', '한화', 'HH'),
       ('두산 베어스', '두산', 'OB');

-- 2. 구장 데이터
INSERT INTO stadiums (stadium_id, full_name, short_name, location, latitude, longitude)
VALUES (1, '챔피언스필드', '챔피언스필드', '광주', 35.1683, 126.8889),
       (2, '잠실야구장', '잠실구장', '잠실', 37.5121, 127.0710),
       (3, '고척스카이돔', '고척돔', '고척', 37.4982, 126.8676),
       (4, '수원KT위즈파크', '위즈파크', '수원', 37.2996, 126.9707),
       (5, '대구삼성라이온즈파크', '라이온즈파크', '대구', 35.8419, 128.6815),
       (6, '사직야구장', '사직구장', '부산', 35.1943, 129.0615),
       (7, '문학야구장', '랜더스필드', '인천', 37.4361, 126.6892),
       (8, '마산야구장', '엔씨파크', '마산', 35.2281, 128.6819),
       (9, '이글스파크', '볼파크', '대전', 36.3173, 127.4280);
