INSERT INTO teams (name, short_name, team_code)
VALUES ('기아 타이거즈', '기아', 'HT'),
       ('롯데 자이언츠', '롯데', 'LT'),
       ('삼성 라이온즈', '삼성', 'SS'),
       ('두산 베어스', '두산', 'OB'),
       ('LG 트윈스', 'LG', 'LG'),
       ('KT 위즈', 'KT', 'KT');

INSERT INTO stadiums (full_name, short_name, location, latitude, longitude)
VALUES ('잠실 야구장', '잠실구장', '잠실', 37.512192, 127.072055),
       ('고척 스카이돔', '고척돔', '고척', 37.498191, 126.867073),
       ('인천 SSG 랜더스필드', '랜더스필드', '인천', 37.437196, 126.693294),
       ('대전 한화생명 볼파크', '볼파크', '대전', 36.316589, 127.431211),
       ('광주 KIA 챔피언스필드', '챔피언스필드', '광주', 35.168282, 126.889138),
       ('대구 삼성라이온즈파크', '라이온즈파크', '대구', 35.841318, 128.681559),
       ('창원 NC파크', '엔씨파크', '창원', 35.222754, 128.582251),
       ('수원 KT위즈파크', '위즈파크', '수원', 37.299977, 127.009690),
       ('부산 사직야구장', '사직구장', '부산', 35.194146, 129.061497);
